<a href="https://colab.research.google.com/github/np03cs4a240319-eng/Concept-and-technology-of-AI/blob/main/Divyanikhatri_worksheet3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [13]:
import pandas as pd
df = pd.read_csv("bank.csv")
head=df.head()
print("\n Data head")
print(head)
# dataset.tail()
# dataset.info()

sort_by_age = df.sort_values(by='age')
print("\n Sorted by age")
print(sort_by_age.head())

 Data head
   age           job  marital  education default  balance housing loan  \
0   58    management  married   tertiary      no     2143     yes   no
1   44    technician   single  secondary      no       29     yes   no
2   33  entrepreneur  married  secondary      no        2     yes  yes
3   47   blue-collar  married    unknown      no     1506     yes   no
4   33       unknown   single    unknown      no        1      no   no

   contact  day month  duration  campaign  pdays  previous poutcome   y
0  unknown    5   may       261         1     -1         0  unknown  no
1  unknown    5   may       151         1     -1         0  unknown  no
2  unknown    5   may        76         1     -1         0  unknown  no
3  unknown    5   may        92         1     -1         0  unknown  no
4  unknown    5   may       198         1     -1         0  unknown  no

 Sorted by age
       age      job marital education default  balance housing loan  \
40744   18  student  single   unknown      no      108      no   no
42274   18  student  single   primary      no      608      no   no
40736   18  student  single   primary      no     1944      no   no
41222   18  student  single   unknown      no       35      no   no
41273   18  student  single   unknown      no        3      no   no

         contact  day month  duration  campaign  pdays  previous poutcome    y
40744   cellular   10   aug       167         1     -1         0  unknown  yes
42274   cellular   13   nov       210         1     93         1  success  yes
40736  telephone   10   aug       122         3     -1         0  unknown   no
41222  telephone   21   aug       104         2     -1         0  unknown   no
41273   cellular   25   aug       130         2     -1         0  unknown  yes

In [ ]:


data = {
    "Name":["Divyani", "Khatri", "Chhetri"],
    "Roll":[10, 20, 30],
    "salary":[10000, 20000, 30000]
}
df = pd.DataFrame(data, index=['a', 'c', 'b'])
print(df)
# df['salary']
sorted_by_roll=df.sort_values(by='Roll')
print(sorted_by_roll.head())

      Name  Roll  salary
a  Divyani    10   10000
c   Khatri    20   20000
b  Chhetri    30   30000
      Name  Roll  salary
a  Divyani    10   10000
c   Khatri    20   20000
b  Chhetri    30   30000

In [ ]:
import pandas as pd
titanic = pd.read_csv('/content/Titanic-Dataset.csv')

# 1.
fare = titanic.loc[:, ['Fare']]
print("1. Fare DataFrame (head):")
print(fare.head())
print()

# 2.
class_age = titanic.loc[:, ['Pclass', 'Age']]
print("2. Class_Age DataFrame (head):")
print(class_age.head())
print()

# 3.
survived_gender = titanic.loc[:, ['Survived', 'Sex']]
print("3. Survived_Gender DataFrame (head):")
print(survived_gender.head())

1. Fare DataFrame (head):
      Fare
0   7.2500
1  71.2833
2   7.9250
3  53.1000
4   8.0500

2. Class_Age DataFrame (head):
   Pclass   Age
0       3  22.0
1       1  38.0
2       3  26.0
3       1  35.0
4       3  35.0

3. Survived_Gender DataFrame (head):
   Survived     Sex
0         0    male
1         1  female
2         1  female
3         1  female
4         0    male

In [ ]:
import pandas as pd

df = pd.read_csv('/content/Titanic-Dataset.csv')
print("Problem-2 'Subsetting' ")

#1.
fare_gt_100 = df[df['Fare'] > 100]
print("Fare Greater than 100")
print(f"Shape: {fare_gt_100.shape}")
print(fare_gt_100.head())

#2.
first_class = df[df['Pclass']==1]
print("First Class (Pclass): ")
print(f"Shape: {first_class.shape}")
print(first_class.head())

#3.
female_under_18 = df[(df['Age'] < 18) & (df['Sex'] == 'female')]
print("Female under 18: ")
print(f"Shape: {female_under_18.shape}")
print(female_under_18.head)


print("\nSubsetting rows by categorical variables: ")

#1.
embarked_c_or_s = df[df['Embarked'].isin(['c', 's'])]
print("Embarked_c_or_s:")
print(f"Shape: {embarked_c_or_s.shape}")
print(embarked_c_or_s.head())

#2.
first_second_class = df[df['Pclass'].isin([1, 2])]
print("First second class: ")
print(f"Shape: {first_second_class.shape}")
print(first_second_class.head())

Problem-2 'Subsetting'
Fare Greater than 100
Shape: (53, 12)
     PassengerId  Survived  Pclass  \
27            28         0       1
31            32         1       1
88            89         1       1
118          119         0       1
195          196         1       1

                                               Name     Sex   Age  SibSp  \
27                   Fortune, Mr. Charles Alexander    male  19.0      3
31   Spencer, Mrs. William Augustus (Marie Eugenie)  female   NaN      1
88                       Fortune, Miss. Mabel Helen  female  23.0      3
118                        Baxter, Mr. Quigg Edmond    male  24.0      0
195                            Lurette, Miss. Elise  female  58.0      0

     Parch    Ticket      Fare        Cabin Embarked
27       2     19950  263.0000  C23 C25 C27        S
31       0  PC 17569  146.5208          B78        C
88       2     19950  263.0000  C23 C25 C27        S
118      1  PC 17558  247.5208      B58 B60        C
195      0  PC 17569  146.5208          B80        C
First Class (Pclass):
Shape: (216, 12)
    PassengerId  Survived  Pclass  \
1             2         1       1
3             4         1       1
6             7         0       1
11           12         1       1
23           24         1       1

                                                 Name     Sex   Age  SibSp  \
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                             McCarthy, Mr. Timothy J    male  54.0      0
11                           Bonnell, Miss. Elizabeth  female  58.0      0
23                       Sloper, Mr. William Thompson    male  28.0      0

    Parch    Ticket     Fare Cabin Embarked
1       0  PC 17599  71.2833   C85        C
3       0    113803  53.1000  C123        S
6       0     17463  51.8625   E46        S
11      0    113783  26.5500  C103        S
23      0    113788  35.5000    A6        S
Female under 18:
Shape: (55, 12)
<bound method NDFrame.head of      PassengerId  Survived  Pclass  \
9             10         1       2
10            11         1       3
14            15         0       3
22            23         1       3
24            25         0       3
39            40         1       3
43            44         1       2
58            59         1       2
68            69         1       3
71            72         0       3
84            85         1       2
111          112         0       3
114          115         0       3
119          120         0       3
147          148         0       3
156          157         1       3
172          173         1       3
184          185         1       3
205          206         0       3
208          209         1       3
233          234         1       3
237          238         1       2
297          298         0       1
307          308         1       1
329          330         1       1
374          375         0       3
381          382         1       3
389          390         1       2
419          420         0       3
435          436         1       1
446          447         1       2
448          449         1       3
469          470         1       3
479          480         1       3
504          505         1       1
530          531         1       2
535          536         1       2
541          542         0       3
542          543         0       3
618          619         1       2
634          635         0       3
642          643         0       3
644          645         1       3
689          690         1       1
691          692         1       3
720          721         1       2
750          751         1       2
777          778         1       3
780          781         1       3
781          782         1       1
813          814         0       3
830          831         1       3
852          853         0       3
853          854         1       1
875          876         1       3

                                                  Name     Sex    Age  SibSp  \
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.00      1
10                     Sandstrom, Miss. Marguerite Rut  female   4.00      1
14                Vestrom, Miss. Hulda Amanda Adolfina  female  14.00      0
22                         McGowan, Miss. Anna "Annie"  female  15.00      0
24                       Palsson, Miss. Torborg Danira  female   8.00      3
39                         Nicola-Yarred, Miss. Jamila  female  14.00      1
43            Laroche, Miss. Simonne Marie Anne Andree  female   3.00      1
58                        West, Miss. Constance Mirium  female   5.00      1
68                     Andersson, Miss. Erna Alexandra  female  17.00      4
71                          Goodwin, Miss. Lillian Amy  female  16.00      5
84                                 Ilett, Miss. Bertha  female  17.00      0
111                               Zabour, Miss. Hileni  female  14.50      1
114                              Attalah, Miss. Malake  female  17.00      0
119                  Andersson, Miss. Ellis Anna Maria  female   2.00      4
147                   Ford, Miss. Robina Maggie "Ruby"  female   9.00      2
156                   Gilnagh, Miss. Katherine "Katie"  female  16.00      0
172                       Johnson, Miss. Eleanor Ileen  female   1.00      1
184                Kink-Heilmann, Miss. Luise Gretchen  female   4.00      0
205                         Strom, Miss. Telma Matilda  female   2.00      0
208                          Carr, Miss. Helen "Ellen"  female  16.00      0
233                     Asplund, Miss. Lillian Gertrud  female   5.00      4
237                   Collyer, Miss. Marjorie "Lottie"  female   8.00      0
297                       Allison, Miss. Helen Loraine  female   2.00      1
307  Penasco y Castellana, Mrs. Victor de Satode (M...  female  17.00      1
329                       Hippach, Miss. Jean Gertrude  female  16.00      0
374                         Palsson, Miss. Stina Viola  female   3.00      3
381                        Nakid, Miss. Maria ("Mary")  female   1.00      0
389                              Lehmann, Miss. Bertha  female  17.00      0
419                          Van Impe, Miss. Catharina  female  10.00      0
435                          Carter, Miss. Lucile Polk  female  14.00      1
446                  Mellinger, Miss. Madeleine Violet  female  13.00      0
448                     Baclini, Miss. Marie Catherine  female   5.00      2
469                      Baclini, Miss. Helene Barbara  female   0.75      2
479                           Hirvonen, Miss. Hildur E  female   2.00      0
504                              Maioni, Miss. Roberta  female  16.00      0
530                           Quick, Miss. Phyllis May  female   2.00      1
535                             Hart, Miss. Eva Miriam  female   7.00      0
541               Andersson, Miss. Ingeborg Constanzia  female   9.00      4
542                  Andersson, Miss. Sigrid Elisabeth  female  11.00      4
618                        Becker, Miss. Marion Louise  female   4.00      2
634                                 Skoog, Miss. Mabel  female   9.00      3
642                      Skoog, Miss. Margit Elizabeth  female   2.00      3
644                             Baclini, Miss. Eugenie  female   0.75      2
689                  Madill, Miss. Georgette Alexandra  female  15.00      0
691                                 Karun, Miss. Manca  female   4.00      0
720                  Harper, Miss. Annie Jessie "Nina"  female   6.00      0
750                                  Wells, Miss. Joan  female   4.00      1
777                      Emanuel, Miss. Virginia Ethel  female   5.00      0
780                               Ayoub, Miss. Banoura  female  13.00      0
781          Dick, Mrs. Albert Adrian (Vera Gillespie)  female  17.00      1
813                 Andersson, Miss. Ebba Iris Alfrida  female   6.00      4
830            Yasbeck, Mrs. Antoni (Selini Alexander)  female  15.00      1
852                            Boulos, Miss. Nourelain  female   9.00      1
853                          Lines, Miss. Mary Conover  female  16.00      0
875                   Najib, Miss. Adele Kiamie "Jane"  female  15.00      0

     Parch         Ticket      Fare    Cabin Embarked
9        0         237736   30.0708      NaN        C
10       1        PP 9549   16.7000       G6        S
14       0         350406    7.8542      NaN        S
22       0         330923    8.0292      NaN        Q
24       1         349909   21.0750      NaN        S
39       0           2651   11.2417      NaN        C
43       2  SC/Paris 2123   41.5792      NaN        C
58       2     C.A. 34651   27.7500      NaN        S
68       2        3101281    7.9250      NaN        S
71       2        CA 2144   46.9000      NaN        S
84       0     SO/C 14885   10.5000      NaN        S
111      0           2665   14.4542      NaN        C
114      0           2627   14.4583      NaN        C
119      2         347082   31.2750      NaN        S
147      2     W./C. 6608   34.3750      NaN        S
156      0          35851    7.7333      NaN        Q
172      1         347742   11.1333      NaN        S
184      2         315153   22.0250      NaN        S
205      1         347054   10.4625       G6        S
208      0         367231    7.7500      NaN        Q
233      2         347077   31.3875      NaN        S
237      2     C.A. 31921   26.2500      NaN        S
297      2         113781  151.5500  C22 C26        S
307      0       PC 17758  108.9000      C65        C
329      1         111361   57.9792      B18        C
374      1         349909   21.0750      NaN        S
381      2           2653   15.7417      NaN        C
389      0        SC 1748   12.0000      NaN        C
419      2         345773   24.1500      NaN        S
435      2         113760  120.0000  B96 B98        S
446      1         250644   19.5000      NaN        S
448      1           2666   19.2583      NaN        C
469      1           2666   19.2583      NaN        C
479      1        3101298   12.2875      NaN        S
504      0         110152   86.5000      B79        S
530      1          26360   26.0000      NaN        S
535      2   F.C.C. 13529   26.2500      NaN        S
541      2         347082   31.2750      NaN        S
542      2         347082   31.2750      NaN        S
618      1         230136   39.0000       F4        S
634      2         347088   27.9000      NaN        S
642      2         347088   27.9000      NaN        S
644      1           2666   19.2583      NaN        C
689      1          24160  211.3375       B5        S
691      1         349256   13.4167      NaN        C
720      1         248727   33.0000      NaN        S
750      1          29103   23.0000      NaN        S
777      0         364516   12.4750      NaN        S
780      0           2687    7.2292      NaN        C
781      0          17474   57.0000      B20        S
813      2         347082   31.2750      NaN        S
830      0           2659   14.4542      NaN        C
852      1           2678   15.2458      NaN        C
853      1       PC 17592   39.4000      D28        S
875      0           2667    7.2250      NaN        C  >

Subsetting rows by categorical variables:
Embarked_c_or_s:
Shape: (0, 12)
Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []
First second class:
Shape: (400, 12)
    PassengerId  Survived  Pclass  \
1             2         1       1
3             4         1       1
6             7         0       1
9            10         1       2
11           12         1       1

                                                 Name     Sex   Age  SibSp  \
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                             McCarthy, Mr. Timothy J    male  54.0      0
9                 Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
11                           Bonnell, Miss. Elizabeth  female  58.0      0

    Parch    Ticket     Fare Cabin Embarked
1       0  PC 17599  71.2833   C85        C
3       0    113803  53.1000  C123        S
6       0     17463  51.8625   E46        S
9       0    237736  30.0708   NaN        C
11      0    113783  26.5500  C103        S

In [ ]:

import pandas as pd
import numpy as np

df = pd.read_csv('/content/Titanic-Dataset.csv')
#1.
df['fare_per_year'] = df['Fare'] / df['Age']
#2.
high_fare_age = df[df['fare_per_year'] >5 ]
#3.
high_fare_age_sort = high_fare_age.sort_values('fare_per_year', ascending=False)
#4.
result = high_fare_age_sort[['Name', 'fare_per_year']]
#5.
print(result.head())

print(f"Name: {result.iloc[0]['Name']}")
print(f"Fare per year: {result.iloc[0]['fare_per_year']:.2f}")

                                Name  fare_per_year
305   Allison, Master. Hudson Trevor     164.728261
297     Allison, Miss. Helen Loraine      75.775000
386  Goodwin, Master. Sidney Leonard      46.900000
164     Panula, Master. Eino Viljami      39.687500
183        Becker, Master. Richard F      39.000000
Name: Allison, Master. Hudson Trevor
Fare per year: 164.73

In [ ]:
df = pd.read_csv('/content/Titanic-Dataset.csv')
#1.
df['fare_per_class'] = df['Fare'] / df['Pclass']
#2.
adult_males = df[(df['Sex']=='male') & (df['Age'] >= 18)]
#3.
adult_males_sort = adult_males.sort_values('fare_per_class', ascending=False)
#4.
result = adult_males_sort[['Name', 'Age', 'fare_per_class']]
#5.
print(result.head())

print(f"Name: {result.iloc[0]['Name']}")
print(f"Age: {result.iloc[0]['Age']}")
print(f"Fare per class: {result.iloc[0]['fare_per_class']:.2f}")

                                   Name   Age  fare_per_class
737              Lesurer, Mr. Gustave J  35.0        512.3292
679  Cardeza, Mr. Thomas Drake Martinez  36.0        512.3292
438                   Fortune, Mr. Mark  64.0        263.0000
27       Fortune, Mr. Charles Alexander  19.0        263.0000
118            Baxter, Mr. Quigg Edmond  24.0        247.5208
Name: Lesurer, Mr. Gustave J
Age: 35.0
Fare per class: 512.33

In [ ]:
df = pd.read_csv('/content/Titanic-Dataset.csv')
#1.
total_fare = df['Fare'].sum()
#2.
first_class_fare = df[df['Pclass']==1]['Fare'].sum()
second_class_fare = df[df['Pclass']==2]['Fare'].sum()
third_class_fare = df[df['Pclass']==3]['Fare'].sum()

#3
class_fares = [first_class_fare, second_class_fare, third_class_fare]
#4.
first_class_pro = (first_class_fare / total_fare)*100
second_class_pro = (second_class_fare / total_fare)*100
third_class_pro = (third_class_fare / total_fare)*100

print(f"Total Fare Revenue: ${total_fare:.2f}")
print(f"\nBy Class:")
print(f"First Class:  ${first_class_fare:.2f} ({first_class_pro:.1f}%)")
print(f"Second Class: ${second_class_fare:.2f} ({second_class_pro:.1f}%)")
print(f"Third Class:  ${third_class_fare:.2f} ({third_class_pro:.1f}%)")

Total Fare Revenue: $28693.95

By Class:
First Class:  $18177.41 (63.3%)
Second Class: $3801.84 (13.2%)
Third Class:  $6714.70 (23.4%)

In [ ]:
df = pd.read_csv('/content/Titanic-Dataset.csv')
#1.
def get_age_group(age):
    if pd.isnull(age):
        return 'Unknown'
    elif age < 18:
        return 'child'
    elif age < 65:
        return 'adult'
    else:
        return 'senior'

df['age_group'] = df['Age'].apply(get_age_group)

# 2
total_passengers = len(df)

for group in ['child', 'adult', 'senior', 'Unknown']:
    count = (df['age_group'] == group).sum()
    percentage = (count / total_passengers) * 100
    print(f"{group}: {count} passengers ({percentage:.1f}%)")

child: 113 passengers (12.7%)
adult: 590 passengers (66.2%)
senior: 11 passengers (1.2%)
Unknown: 177 passengers (19.9%)